Кафе/src/Documents/ВедомостьВБанк/ВедомостьВБанк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьВБанк</name>
  <basedOn>Document.НачислениеЗарплаты</basedOn>
  <attributes>
    <name>ВидВыплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДохода</name>
    <type>
      <types>EnumRef.ВидДохода</types>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыплатаЗарплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КОплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЛицевогоСчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Кафе/src/Documents/ВедомостьВБанк/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда

		Месяц = ДанныеЗаполнения.МесяцНачисления;
		ВидВыплаты = ДанныеЗаполнения.ВидВыплаты;
		Для Каждого ТекСтрокаЗарплата Из ДанныеЗаполнения.Зарплата Цикл
			НоваяСтрока = ВыплатаЗарплаты.Добавить();
			НоваяСтрока.НДФЛ = ТекСтрокаЗарплата.НачисленоИтого * 13 / 100;
			НоваяСтрока.КОплате = ТекСтрокаЗарплата.НачисленоИтого - НоваяСтрока.НДФЛ;
			НоваяСтрока.Сотрудник = ТекСтрокаЗарплата.Сотрудник;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
